#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main()
//{
//	int a = -20;
//	unsigned int b = 10;
//	printf("a+b=%d", a + b);
//	return 0;
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n",i);
//	}
//	return 0;
//}

//#include <string.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d",strlen(a));
//	return 0;
//}

//int main()
//{
//	unsigned char i = 0;
//	for (i = 0; i <= 255; i++)
//	{
//		printf("Hello world\n");
//	}
//	return 0;
//}

int main()
{
	int n = 9;
	//00000000000000000000000000001001 - 补码
	float* pFloat = (float*)&n;
	printf("n的值是%d\n",n);
	//00000000000000000000000000001001   - 整型视角
	printf("*pFloat的值为%f\n",*pFloat);
	//0 00000000 00000000000000000001001 - 浮点型视角
	//E为全0时，M前补0和小数点，E取1-127，如下：
	//(-1)^0*0.00000000000000000001001*2^126
	//（%f输出float类型，输出6为小数）
	*pFloat = 9.0;
	//1001.0 - n的二进制序列
	//0*1.001*2^3 - 科学计数法
	//(-1)^0*1.001*2^3 - 存入内存中如下：
	//0 10000010 00100000000000000000000 - E = 3 + 127
	printf("num的值是%d\n", n);
	//01000001000100000000000000000000 - 整型视角
	//1091567616 - 符号位为，正数原反补相同，%d打印十进制数
	printf("*pFloat的值为%f\n", *pFloat);
	return 0;
}


//int main()
//{
//	float a = 5.5;
//	//5.5   - 十进制
//	//101.1 - 二进制
//	//(-1)^0*1.011*2^2 - 科学计数法
//	//S = 0
//	//M = 1.011
//	//E = 2
//	//E = 2 + 127 = 129 - 加上中间数存进内存
//	//10000001 - E的二进制序列
//	//0 10000001 01100000000000000000000 - 内存中由S、E、M组成
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40b00000 - 改为16进制写法
//	return 0;
//}