#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	int a = 5;
//	char b = 'c';
//	char* p = &b;
//	int arr[10] = { 0 };
//	//sizeof计算变量所占内存空间大小，单位是字节。
//	printf("%d\n", sizeof(a));  //4(整型变量)
//	printf("%d\n", sizeof(int));  //4
//	printf("%d\n", sizeof(b));  //1（b中有一个字符）
//	printf("%d\n", sizeof(char));  //1
//	printf("%d\n", sizeof(p));  //8（指针大小为4（32位平台）或8（64位平台））
//	printf("%d\n", sizeof(char*));  //8
//	printf("%d\n", sizeof(arr));  //40（数组中有10个元素，每一个元素是一个整型（4个字节））
//	printf("%d\n", sizeof(int[10]));  //40
//	return 0;
//}

//int main()
//{
//	short s = 0;  //short短整型，占据两个字节的空间
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5));
//	//a和5相加放进s中，无论a是什么类型，相加过后都要按照s的类型存储
//	//sizeof计算表达式的大小就是s的大小，就是s的类型的大小，就是2
//	printf("%d", s);  //sizeof操作符处的表达式不会真实进行运算
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	//~按（二进制）位取反
//	//00000000000000000000000000000000 - 0的二进制数：
//	//11111111111111111111111111111111 - 按位取反（补码）
//	//11111111111111111111111111111110 - 反码（补码-1）
//	//10000000000000000000000000000001 - 源码（取反）
//	printf("%d",~a);
//	return 0;
//}

//int main()
//{
//	int a = 11;
//	a = a | (1 << 2);
//	printf("a1 = %d\n", a);
//	//00000000000000000000000000001011 - 将a的二进制位的第三位改为1
//	//00000000000000000000000000000100 - 按位或4
//		//00000000000000000000000000000001 - 1 << 2
//	//00000000000000000000000000001111 - a = 15  
//	//00000000000000000000000000001111 - 将a的二进制位的第三位改回0
//	// 1111111111111111111111111111011 - 第三位按位与0
//		//00000000000000000000000000000100 - 上面二进制数通过1 << 2取反得到
//	//00000000000000000000000000001011
//	a = a & (~(1 << 2));
//	printf("a2 = %d\n", a);
//	return 0;
//}

//int main()
//{
//	int a = 11;
//	printf("a1 = %d\n", ++a);  //前置++，先++再打印
//	printf("a2 = %d\n", a++);  //后置++，先打印再++
//	return 0;
//}


//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//(2)
//}
//void test2(char ch[]) 
//{
//	printf("%d\n", sizeof(ch));//(4)
//}
//I
//int main()
//{
//	int arr[10] = { 0 }; 
//	char ch[10] = { e };
//	printf("%d\n", sizeof(arr));//(1)
//	printf( "%d\n", sizeof(ch));//(3)
//	test1(arr);
//	test2(ch);
//	return 0;
//}

//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));  //8
//}
//
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));  //8
//}
//
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));  //40
//	printf("%d\n", sizeof(ch));  //10
//	test1(arr);
//	test2(ch);
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	int b = 3;
//	int c = 0; 
//	int d = 5;
//	printf("%d", c = a || b);  //1
//	printf("%d", d = b && c);  //1
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ || ++b || d++;
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = 13;
//	int c = 0;
//	c = (a > b ? a - b : b - a);
//	printf("%d", c);
//	return 0;
//}

//逗号表达式
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);
//	printf("%d", c);
//	return 0;
//}

//函数调用操作符
//int get_max(int x, int y)  //此处的()是函数定义时候的语法规则，不是函数调用操作符
//{
//	return (x > y ? x : y);
//}
//int main()
//{
//	int a = 5;
//	int b = 8;
//	int max = get_max(a, b);  //函数调用时的()是函数调用操作符
//	printf("%d", max);
//	return 0;
//}


//struct Stu  //创建一个结构体类型。类型名：struct Stu
//{
//	//描述学生的相关属性
//	char name[20];
//	int age;
//	char id[20];
//};
//int main()
//{
//	int a = 10;
//	//使用struct Stu类型创建了一个学生对象s1，并初始化
//	struct Stu s1 = { "张三",20,"20220511" };  
//	struct Stu* ps = &s1;  //s1在内存中有实际存放的地址，
//	printf("%s\n", (*ps).name);
//	printf("%s\n", ps->name);
//	//printf("%s\n", s1.name);
//	//printf("%d\n", s1.age);
//	//printf("%s\n", s1.id);
//	return 0;
//}

//整型提升
//int main()
//{
//	char a = 3;  //a实际存放值是00000011
//	//00000000000000000000000000000011 - 3。正整数的原码反码补码相同
//	char b = 127;  //b实际存放的值是01111111
//	//00000000000000000000000001111111 - 127
//	char c = a + b;
//	//a和b相加时，因为a和b自身的大小都是char类型，大小没有达到整型的大小，为提升计算精度，需要整型提升
//	//00000011 - a
//	//01111111 - b
//	//00000000000000000000000000000011 - char a整型提升到int a
//	//00000000000000000000000001111111 - char b整型提升到int b
//	//00000000000000000000000010000010 - int c=a+b，二进制逢二进一
//	//10000010 - 存储进char c，需要被截断
//	printf("%d\n", c);
//	//11111111111111111111111110000010 - char c整形提升  此时还是内存中的值，即补码，打印出来的值需要是源码
//	//11111111111111111111111110000001 - 补码-1=反码
//	//10000000000000000000000001111110 - 反码取反=源码
//}

//int main()
//{
//	char c1 = -1;
//	//10000001 - 源码
//	//11111110 - 反码
//	//11111111 - 补码
//	//11111111111111111111111111111111 - 整型提升
//	char c2 = 1;
//	//00000001 - 源码反码补码相同
//	//00000000000000000000000000000001 - 整型提升
//	return 0;
//}

int main()
{
	char a = 0xb6;
	//10110110 - a
	short b = 0xb600;
	//1011011000000000 - b
	int c = 0xb6000000;
	//10110110000000000000000000000000 - c
	if (a == 0xb6)  //比较运算，a需要整型提升
		//11111111111111111111111110110110 - a，不等于0xb6
		printf("a");
	if (b == 0xb600)  //比较运算，b需要整型提升
		//11111111111111111011011000000000 - b，不等于0xb600
		printf("b");
	if (c = 0xb6000000)  //比较运算，b需要整型提升
		//10110110000000000000000000000000 - c，等于0xb6000000
		printf("c");
	return 0;
}

int main()
{
	char c = 1;
	printf("%u\n", (c));  //1。c是char类型的变量
	printf("%u\n", (+c));  //4。+c进行了运算，需要把c做整型提升，c变为整型大小
	return 0;
}